cat_tinder_backend/app/controllers/cats_controller.rb

    def create
        cat = Cat.create(cat_params)
---
INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at", "story", "image") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        cat = Cat.find(params[:id])
        cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "age" = $2, "enjoys" = $3, "story" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "Muffins "], ["age", 2], ["enjoys", "Muffins muffins muffins"], ["story", "yessir this is me muffins."], ["updated_at", "2020-08-21 21:14:42.781362"], ["id", 1]]

    def destroy
        cat = Cat.find(params[:id])
        cat.destroy
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]

    def show
        cat = Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]